# BindLinkWillDeleteAllPartsWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures..::..BindLinkWillDeleteAllPartsWarning Property
BuiltInFailures..::..DPartFailures Class See Also
---
Bind Link will delete its associated Parts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BindLinkWillDeleteAllPartsWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BindLinkWillDeleteAllPartsWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BindLinkWillDeleteAllPartsWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DPartFailures Class
Autodesk.Revit.DB Namespace